Revit 2024 API
BuiltInFailures.CurtainWallFailures.GridlinesOutsideWillBeRedependent Property
 Type associated curtain grid lines outside of the edited wall boundaries will be made dependent again in order that they remain on the wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId GridlinesOutsideWillBeRedependent { get; }
Visual Basic
Public Shared ReadOnly Property GridlinesOutsideWillBeRedependent As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ GridlinesOutsideWillBeRedependent {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace